{
  "posts": [
    {
      "id": 1,
      "title": "How to Learn JavaScript in 2024",
      "body": "JavaScript is one of the most popular programming languages in the world. In this article, we'll cover the basics of learning JavaScript, including the key concepts and resources that will help you master it in 2024.",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Unofficial_JavaScript_logo_2.svg/800px-Unofficial_JavaScript_logo_2.svg.png"
    },
    {
      "id": 2,
      "title": "The Importance of SEO for Your Blog",
      "body": "Search Engine Optimization (SEO) plays a crucial role in the success of your blog. This post will guide you through the best SEO practices for 2024, helping you rank higher in search engine results and attract more readers.",
      "image": "https://admatazz.co.in/wp-content/uploads/2024/01/SEO-blog-banner.jpg"
    },
    {
      "id": 3,
      "title": "10 Tips for Writing Engaging Blog Posts",
      "body": "Writing engaging blog posts can be challenging. In this article, we provide you with 10 actionable tips to make your blog posts more interesting, informative, and shareable, keeping your readers coming back for more.",
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRMC61i94ktyyrGL6WOVHXao_KkN-xobhIfsg&s"
    },
    {
      "id": 4,
      "title": "A Beginner’s Guide to Vue.js",
      "body": "Vue.js is a progressive JavaScript framework that is widely used for building user interfaces. This guide will introduce you to the basics of Vue.js, explaining its core concepts and how you can get started building your first Vue.js application.",
      "image": "https://i.ytimg.com/vi/p5wegvLDpQ8/maxresdefault.jpg"
    },
    {
      "id": 5,
      "title": "How to Monetize Your Blog in 2024",
      "body": "Monetizing your blog can be a great way to earn passive income. In this post, we discuss various methods for monetizing your blog, including advertising, affiliate marketing, sponsored posts, and creating digital products.",
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTzT8XwDB3D22FWbbArdh4pSXOSDjr8DJVpfw&s"
    }
  ]
}
